function Autobiography(){
    return <div className="autobiography" id="autobiography">
        <div className="left">
            <h2>自傳</h2>
            <h3>autobiography</h3>
        </div>
        <div className="right">
            <p className="text">
                <b>1.個人背景</b>
                <br/>我是蕭傳原，來自台中市，「當停止嘗試時，就是失敗的時候」這是我一貫的座右銘，
                旨在激勵自己，遇到困難時要勇於嘗試各個方法，不能輕言放棄。遇到新事物或技術時，我會對其產生好奇心，促使我進一步的了解該事物或技術。
                由於家中觀念較傳統，因此從小就養成尊重他人的觀念，除此之外，責任感與提升自我能力，是我對自身的要求。
                <br/><br/>
                <b>2.求學歷程與專題經驗</b>
                <br/>就讀於高雄師範大學軟體工程與管理學系，我的學習歷程涵蓋了多元的程式設計及資訊技術。<br/><br/>大一時修習了軟體工程與程式設計導論(python)、計算機概論、
                程式設計(C)、人機互動、計算機網路等入門課程，為後續的課程奠定基礎。由於之前從未接觸過程式語言，在一開始的學習上比較艱辛，正因如此，我透過網路資源、
                請教同儕、教授等方式，努力提升自我的程式能力。<br/><br/>到了大二，學習了物件導向程式設計(java)、資料結構、人工智慧、演算法，資料庫等進階的課程。開始對建立系統的流程有了一個基本的雛型。
                <br/><br/>大三時，接觸到作業系統、軟體需求分析與管理、軟體設計、資料分析、全球資訊網程式設計(html、CSS、javascript)等課程，其中在全球資訊網程式設計課堂中，
                學習到如何製作網頁，由於寫網頁時系統給我的即時回饋，讓我獲得前所未有的成就感。<br/><br/>同時，也開始進行大四的畢業專題，由於修過人工智慧的課程，因此我與組員選擇實作RNN的LSTM底層實作，
                為了能讓小組成員能深入了解，故我們各自實作一個LSTM模型。首先，先了解LSTM的基本原理，主要是由Forgetgate(遺忘門)、Inputgate(輸入門)、Outputgate(輸出門)所構成，
                再經由Forward(前向傳播)、Backward(反向傳播)來調整各門的權重與偏置，使預測值能夠接近真實值，達到預測的目的。研究過程中，指導教授提供了寶貴的學術指導，
                雖然我們的專題方向和教授的研究領域有所不同，但這種跨領域的挑戰激發了我獨立探索的動力。
                <br/><br/>
                <b>3.工作經驗與活動心得</b>
                <br/>我是一個活潑開朗的人，擅長傾聽與溝通，尤其在團體合作中能夠有效地協調與配合，站在團隊、公司的立場，達成目標。對待工作始終保持高度的熱情與責任感，並且具備謹慎與高效率的工作態度，能夠有效避免錯誤並確保工作品質。
                此外，我樂於面對挑戰，擁有快速學習和解決問題的能力，時刻保持進取的心態。<br/><br/>在大一排球新生盃擔任舉球員時，要在短時間內與還不熟悉的隊友建立默契，我學會了如何迅速觀察隊友的特點並調整自己的舉球方式，確保每一次傳球都能精確地送到隊友手中。
                這不僅提升了我的溝通能力，也讓我學會了在壓力下做出快速決策的能力。通過與隊友的協作，我深刻體會到團隊合作的重要性，這對我後來在學術或工作中的團隊合作發揮了正向的影響。<br/><br/>大二擔任了系上羽球隊的隊長及迎新宿營的隊輔，
                擔任羽球隊隊長時，我學會了如何激勵隊員與管理團隊，調整每位成員的角色，並為團隊設定具體目標，使大家朝著共同的方向努力。<br/><br/>到了大三，擔任迎新宿營的隊輔長一職，我負責規劃整個迎新宿營活動，從行程設計到活動流程的協調，都需要我親自把關。我需要分配各項任務給每位隊輔，
                並密切跟進進度，確保每個環節都按計畫進行。同時，活動過程中我也需要隨時應對突發情況，並迅速找到解決方案，讓活動得以順利進行。這次經歷讓我深刻理解到領導力的核心不僅在於分配任務，更在於如何激勵團隊成員，讓每個人都發揮出自己的最佳表現。
                讓我學會了如何在壓力下冷靜決策、有效溝通，並建立一個高效、融洽的團隊氛圍。這段經驗讓我在團隊協作和問題解決方面獲益良多，並促使我成為一名更成熟的領導者。
                <br/><br/>工作經驗方面，高中畢業後的每個暑假，我都在台中梧棲全聯物流園區的交付部門工作。這個部門的主要職責是協助司機完成出車和回廠的各項手續，包括協助司機找到派車單上的貨物，確認物品齊全後簽名放行；司機回廠時，我也負責清點從門市回來的資材數量，確保無誤。
                每逢中元檔期，物流場幾乎都是爆倉的狀況，工作量成倍增加。我學會了在高壓下保持效率，並根據場內需求靈活調配時間，確保每一項工作都能在規定時間內完成。這段經歷不僅磨練了我的工作韌性，也讓我深刻體會到在團隊合作中，每個人精準履行職責的重要性。
                <br/><br/>
                <b>4.未來展望</b>
                <br/>在未來的職涯中，我期望能將我在學術與實習中學到的技術應用於實際工作中，並持續提升自己的專業能力。我的目標是成為一名技術全面、具備創新思維的全端網站開發工程師，能夠在團隊中發揮所長，解決實際問題，並參與高效且具有挑戰性的專案。
                在學術方面，我已經接觸過多種程式語言與技術，如 Python、Java、JavaScript、HTML、CSS、資料庫設計等，我希望能進一步擴展這些技術的應用範圍，學習更先進的開發工具和框架。
                除了技術能力，我也非常重視團隊合作與領導力的發展。在過去的學術與工作經歷中，我已經具備了協作與領導的基本技能，無論是在團隊合作中扮演重要角色，還是在高壓環境下有效解決問題，我都能冷靜應對並達成目標。
                希望能在未來的工作中，不斷學習和成長，並為公司帶來實質上的貢獻。
            </p>
        </div>
        
    </div>
}
export default Autobiography;